from datetime import date

HOLIDAYS = {
    date(2026, 1, 1),
    date(2026, 1, 2),
    date(2026, 1, 3),
    date(2026, 1, 4),
    date(2026, 1, 5),
    date(2026, 1, 6),
    date(2026, 1, 7),
    date(2026, 1, 8),
    date(2026, 1, 9),
    date(2026, 2, 23),
    date(2026, 3, 8),
    date(2026, 5, 1),
    date(2026, 5, 9),
    date(2026, 5, 10),
    date(2026, 5, 11),
    date(2026, 6, 12),
    date(2026, 11, 4),
}
"""Праздничные дни 2026 года."""

WEEKENDS = (5, 6)
"""Выходные дни."""

NEW_YEAR_START_DAY = 12
"""Начало рабочего года с 12 января."""